## Plan Result (prod-backendappgateway)




<pre><code>Plan: 0 to add, 4 to change, 0 to destroy.</code></pre>

* Update
  * module.backendappgateway.azurerm_application_gateway.ag[0]
  * module.backendappgateway.azurerm_application_gateway.ag[1]
  * module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]
  * module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[1]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.backendappgateway.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.backendappgateway.azurerm_application_gateway.ag[0] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw"
        name                              = "cft-aks00-prod-agw"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (7 unchanged attributes hidden)

      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendAddressPools/aac-manage-case-assignment" -> null
          - ip_addresses = [
              - "10.90.79.250",
              - "10.90.95.250",
            ] -> null
          - name         = "aac-manage-case-assignment" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendAddressPools/adoption-cos-api" -> null
          - ip_addresses = [
              - "10.90.79.250",
              - "10.90.95.250",
            ] -> null
          - name         = "adoption-cos-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendAddressPools/am-org-role-mapping-service" -> null
          - ip_addresses = [
              - "10.90.79.250",
              - "10.90.95.250",
            ] -> null
          - name         = "am-org-role-mapping-service" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendAddressPools/am-role-assignment-service" -> null
          - ip_addresses = [
              - "10.90.79.250",
              - "10.90.95.250",
            ] -> null
          - name         = "am-role-assignment-service" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendAddressPools/bar-api" -> null
          - ip_addresses = [
              - "10.90.79.250",
              - "10.90.95.250",
            ] -> null
          - name         = "bar-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendAddressPools/bulk-scan-orchestrator" -> null
          - ip_addresses = [
              - "10.90.79.250",
              - "10.90.95.250",
            ] -> null
          - name         = "bulk-scan-orchestrator" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendAddressPools/bulk-scan-payment-processor" -> null
          - ip_addresses = [
              - "10.90.79.250",
              - "10.90.95.250",
            ] -> null
          - name         = "bulk-scan-payment-processor" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendAddressPools/bulk-scan-processor" -> null
          - ip_addresses = [
              - "10.90.79.250",
              - "10.90.95.250",
            ] -> null
          - name         = "bulk-scan-processor" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendAddressPools/camunda-api" -> null
          - ip_addresses = [
              - "10.90.79.250",
              - "10.90.95.250",
            ] -> null
          - name         = "camunda-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendAddressPools/camunda-bpm" -> null
          - ip_addresses = [
              - "10.90.79.250",
              - "10.90.95.250",
            ] -> null
          - name         = "camunda-bpm" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendAddressPools/camunda-optimize" -> null
          - ip_addresses = [
              - "10.90.79.250",
              - "10.90.95.250",
            ] -> null
          - name         = "camunda-optimize" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendAddressPools/ccd-admin-web" -> null
          - ip_addresses = [
              - "10.90.79.250",
              - "10.90.95.250",
            ] -> null
          - name         = "ccd-admin-web" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendAddressPools/ccd-case-activity-api" -> null
          - ip_addresses = [
              - "10.90.79.250",
              - "10.90.95.250",
            ] -> null
          - name         = "ccd-case-activity-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendAddressPools/ccd-case-document-am-api" -> null
          - ip_addresses = [
              - "10.90.79.250",
              - "10.90.95.250",
            ] -> null
          - name         = "ccd-case-document-am-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendAddressPools/ccd-case-print-service" -> null
          - ip_addresses = [
              - "10.90.79.250",
              - "10.90.95.250",
            ] -> null
          - name         = "ccd-case-print-service" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendAddressPools/ccd-data-store-api" -> null
          - ip_addresses = [
              - "10.90.79.250",
              - "10.90.95.250",
            ] -> null
          - name         = "ccd-data-store-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendAddressPools/ccd-definition-store-api" -> null
          - ip_addresses = [
              - "10.90.79.250",
              - "10.90.95.250",
            ] -> null
          - name         = "ccd-definition-store-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendAddressPools/ccd-message-publisher" -> null
          - ip_addresses = [
              - "10.90.79.250",
              - "10.90.95.250",
            ] -> null
          - name         = "ccd-message-publisher" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendAddressPools/ccd-user-profile-api" -> null
          - ip_addresses = [
              - "10.90.79.250",
              - "10.90.95.250",
            ] -> null
          - name         = "ccd-user-profile-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendAddressPools/ccpay-bulkscanning-api" -> null
          - ip_addresses = [
              - "10.90.79.250",
              - "10.90.95.250",
            ] -> null
          - name         = "ccpay-bulkscanning-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendAddressPools/ccpay-refunds-api" -> null
          - ip_addresses = [
              - "10.90.79.250",
              - "10.90.95.250",
            ] -> null
          - name         = "ccpay-refunds-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendAddressPools/civil-service" -> null
          - ip_addresses = [
              - "10.90.79.250",
              - "10.90.95.250",
            ] -> null
          - name         = "civil-service" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendAddressPools/cmc-claim-store" -> null
          - ip_addresses = [
              - "10.90.79.250",
              - "10.90.95.250",
            ] -> null
          - name         = "cmc-claim-store" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendAddressPools/cmc-pdf-service" -> null
          - ip_addresses = [
              - "10.90.79.250",
              - "10.90.95.250",
            ] -> null
          - name         = "cmc-pdf-service" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendAddressPools/cpo-case-payment-orders-api" -> null
          - ip_addresses = [
              - "10.90.79.250",
              - "10.90.95.250",
            ] -> null
          - name         = "cpo-case-payment-orders-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendAddressPools/dg-docassembly" -> null
          - ip_addresses = [
              - "10.90.79.250",
              - "10.90.95.250",
            ] -> null
          - name         = "dg-docassembly" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendAddressPools/dg-docmosis" -> null
          - ip_addresses = [
              - "10.90.79.250",
              - "10.90.95.250",
            ] -> null
          - name         = "dg-docmosis" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendAddressPools/div-cfs" -> null
          - ip_addresses = [
              - "10.90.79.250",
              - "10.90.95.250",
            ] -> null
          - name         = "div-cfs" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendAddressPools/div-cms" -> null
          - ip_addresses = [
              - "10.90.79.250",
              - "10.90.95.250",
            ] -> null
          - name         = "div-cms" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendAddressPools/div-cos" -> null
          - ip_addresses = [
              - "10.90.79.250",
              - "10.90.95.250",
            ] -> null
          - name         = "div-cos" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendAddressPools/div-dgs" -> null
          - ip_addresses = [
              - "10.90.79.250",
              - "10.90.95.250",
            ] -> null
          - name         = "div-dgs" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendAddressPools/div-emca" -> null
          - ip_addresses = [
              - "10.90.79.250",
              - "10.90.95.250",
            ] -> null
          - name         = "div-emca" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendAddressPools/div-fps" -> null
          - ip_addresses = [
              - "10.90.79.250",
              - "10.90.95.250",
            ] -> null
          - name         = "div-fps" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendAddressPools/div-hm" -> null
          - ip_addresses = [
              - "10.90.79.250",
              - "10.90.95.250",
            ] -> null
          - name         = "div-hm" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendAddressPools/dm-store" -> null
          - ip_addresses = [
              - "10.90.79.250",
              - "10.90.95.250",
            ] -> null
          - name         = "dm-store" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendAddressPools/draft-store-service" -> null
          - ip_addresses = [
              - "10.90.79.250",
              - "10.90.95.250",
            ] -> null
          - name         = "draft-store-service" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendAddressPools/em-anno" -> null
          - ip_addresses = [
              - "10.90.79.250",
              - "10.90.95.250",
            ] -> null
          - name         = "em-anno" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendAddressPools/em-ccd-orchestrator" -> null
          - ip_addresses = [
              - "10.90.79.250",
              - "10.90.95.250",
            ] -> null
          - name         = "em-ccd-orchestrator" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendAddressPools/em-hrs-api" -> null
          - ip_addresses = [
              - "10.90.79.250",
              - "10.90.95.250",
            ] -> null
          - name         =

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...


          + ip_addresses = [
              + "10.90.95.250",
            ]
          + name         = "probate-back-office"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.90.95.250",
            ]
          + name         = "probate-business-service"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.90.95.250",
            ]
          + name         = "probate-orchestrator-service"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.90.95.250",
            ]
          + name         = "probate-submit-service"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.90.95.250",
            ]
          + name         = "rd-caseworker-ref-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.90.95.250",
            ]
          + name         = "rd-commondata-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.90.95.250",
            ]
          + name         = "rd-judicial-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.90.95.250",
            ]
          + name         = "rd-location-ref-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.90.95.250",
            ]
          + name         = "rd-professional-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.90.95.250",
            ]
          + name         = "rd-profile-sync"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.90.95.250",
            ]
          + name         = "rd-user-profile-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.90.95.250",
            ]
          + name         = "reform-scan-blob-router"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.90.95.250",
            ]
          + name         = "reform-scan-notification-service"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.90.95.250",
            ]
          + name         = "rpe-pdf-service"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.90.95.250",
            ]
          + name         = "rpe-send-letter-service"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.90.95.250",
            ]
          + name         = "rpe-service-auth-provider"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.90.95.250",
            ]
          + name         = "sscs-bulk-scan"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.90.95.250",
            ]
          + name         = "sscs-ccd-callback-orchestrator"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.90.95.250",
            ]
          + name         = "sscs-evidence-share"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.90.95.250",
            ]
          + name         = "sscs-tribunals-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.90.95.250",
            ]
          + name         = "sscs-tya-notif"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.90.95.250",
            ]
          + name         = "wa-case-event-handler"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.90.95.250",
            ]
          + name         = "wa-task-management-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.90.95.250",
            ]
          + name         = "wa-task-monitor"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.90.95.250",
            ]
          + name         = "wa-workflow-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.90.95.250",
            ]
          + name         = "xui-activity-tracker-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.90.95.250",
            ]
          + name         = "xui-terms-and-conditions"
        }

        # (413 unchanged blocks hidden)
    }

  # module.backendappgateway.azurerm_application_gateway.ag[1] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw"
        name                              = "cft-aks01-prod-agw"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (7 unchanged attributes hidden)

      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendAddressPools/am-judicial-booking-service" -> null
          - ip_addresses = [
              - "10.90.79.250",
              - "10.90.95.250",
            ] -> null
          - name         = "am-judicial-booking-service" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendAddressPools/dtsse-ardoq-adapter" -> null
          - ip_addresses = [
              - "10.90.79.250",
              - "10.90.95.250",
            ] -> null
          - name         = "dtsse-ardoq-adapter" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendAddressPools/et-cos" -> null
          - ip_addresses = [
              - "10.90.79.250",
              - "10.90.95.250",
            ] -> null
          - name         = "et-cos" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendAddressPools/et-msg-handler" -> null
          - ip_addresses = [
              - "10.90.79.250",
              - "10.90.95.250",
            ] -> null
          - name         = "et-msg-handler" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendAddressPools/et-sya-api" -> null
          - ip_addresses = [
              - "10.90.79.250",
              - "10.90.95.250",
            ] -> null
          - name         = "et-sya-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendAddressPools/fis-bulk-scan-api" -> null
          - ip_addresses = [
              - "10.90.79.250",
              - "10.90.95.250",
            ] -> null
          - name         = "fis-bulk-scan-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendAddressPools/fis-cos-api" -> null
          - ip_addresses = [
              - "10.90.79.250",
              - "10.90.95.250",
            ] -> null
          - name         = "fis-cos-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendAddressPools/fis-hmc-api" -> null
          - ip_addresses = [
              - "10.90.79.250",
              - "10.90.95.250",
            ] -> null
          - name         = "fis-hmc-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendAddressPools/ia-bail-case-api" -> null
          - ip_addresses = [
              - "10.90.79.250",
              - "10.90.95.250",
            ] -> null
          - name         = "ia-bail-case-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendAddressPools/plum-recipe-backend" -> null
          - ip_addresses = [
              - "10.90.79.250",
              - "10.90.95.250",
            ] -> null
          - name         = "plum-recipe-backend" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendAddressPools/sptribs-case-api" -> null
          - ip_addresses = [
              - "10.90.79.250",
              - "10.90.95.250",
            ] -> null
          - name         = "sptribs-case-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendAddressPools/sscs-hearings-api" -> null
          - ip_addresses = [
              - "10.90.79.250",
              - "10.90.95.250",
            ] -> null
          - name         = "sscs-hearings-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendAddressPools/ts-translation-service" -> null
          - ip_addresses = [
              - "10.90.79.250",
              - "10.90.95.250",
            ] -> null
          - name         = "ts-translation-service" -> null
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.90.95.250",
            ]
          + name         = "am-judicial-booking-service"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.90.95.250",
            ]
          + name         = "dtsse-ardoq-adapter"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.90.95.250",
            ]
          + name         = "et-cos"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.90.95.250",
            ]
          + name         = "et-msg-handler"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.90.95.250",
            ]
          + name         = "et-sya-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.90.95.250",
            ]
          + name         = "fis-bulk-scan-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.90.95.250",
            ]
          + name         = "fis-cos-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.90.95.250",
            ]
          + name         = "fis-hmc-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.90.95.250",
            ]
          + name         = "ia-bail-case-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.90.95.250",
            ]
          + name         = "plum-recipe-backend"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.90.95.250",
            ]
          + name         = "sptribs-case-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.90.95.250",
            ]
          + name         = "sscs-hearings-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.90.95.250",
            ]
          + name         = "ts-translation-service"
        }

        # (62 unchanged blocks hidden)
    }

  # module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - log {
          - category = "ApplicationGatewayAccessLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayFirewallLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayPerformanceLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

  # module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[1] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - log {
          - category = "ApplicationGatewayAccessLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayFirewallLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayPerformanceLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

Plan: 0 to add, 4 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1425,"Program":"tfcmt","SHA1":"","Target":"prod-backendappgateway","Vars":{}} -->